#+OPTIONS: toc:nil
# #+LaTeX_CLASS: koma-article 

#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation,aspectratio=169]
#+OPTIONS: H:2

#+LaTex_HEADER: \usepackage{khpreamble}
#+LaTex_HEADER: \usepackage{amssymb}
#+LaTex_HEADER: \usepgfplotslibrary{groupplots}

#+LaTex_HEADER: \newcommand*{\shift}{\operatorname{q}}

#+title: Retroalimentación Actividad 2 - Sistema sensorial
#+author: Kjartan Halvorsen
#+date: 2021-02-25

*** Notes                                                          :noexport:
    Las instrucciones de la actividad solomente piden que buscan el rango y resolución adecuada para las varibles. Aqui es dado del 'Class Rule' que el movimiento del brazo tiene un rango de 119 grados. Fácil. Para la resolución tenemos que pensar un poquito mas. Con 'resolución' se entiende el cambio mínimo de la variable que se puede detectar. No encontré información sobre esto, entonces tuve que hacer una suposición.  Pensé que un movimiento de medio centimetro en la posición del ala sí tiene consequencia cuando está bajo del agua en movimiento. Para saber que significa esto en resolución del ángulo del brazo tenemos que usar la relación entre cambio en ángulo y cambio en un punto a cierta radie. Este nos da eps_b = eps_a/r. Como saben, el brazo se mueve con un cilindro hidraulico. Entonces es importante saber que resolución necesitamos en la posición del brazo. Nota el radie sería este : rh = sqrt(da^2 + db^2).
    Por favor piensan bien y responden en el chat: que sería la resolución requerida en la posición del pistón?

    La verdad es que depende de la posición del brazo. 
    
    
#+BEGIN_SRC python :session  :results output 
  import numpy as np  
  eps_a = 5e-3
  r = 3.5
  da = 0.246
  db = 0.377
  rp = np.sqrt(da**2 + db**2)
  eps_b = eps_a/r
  eps_p = eps_b*rp

  rang = 119*np.pi/180
  strokelength = 2*rp*np.cos(np.pi/2 - rang/2)

  print("Radius rp = %0.2f mm" %(rp*1000))
  print("Resolucion eps_b = %0.2f rad = %0.2f grados" %(eps_b, eps_b*180/np.pi))
  print("Resolucion eps_p = %0.2f mm" %(eps_b*rp*1000))
  print("Strokelength = %0.2f mm" %(strokelength*1000))


  #+END_SRC

#+RESULTS:
: Radius rp = 450.16 mm
: Resolucion eps_b = 0.00 rad = 0.08 grados
: Resolucion eps_p = 0.64 mm
: Strokelength = 775.74 mm

*** Notes                                                          :noexport:

#+BEGIN_SRC python :session  :results output 
  import numpy as np  
  rang = 1000.0 #mm
  res = rang/(2**12)
  print("Resolucion = %0.2f mm" %(res))


  #+END_SRC

#+RESULTS:
: Resolucion = 0.24 mm



*** Notes                                                          :noexport:

  #+BEGIN_SRC python :session  :results output 
    import numpy as np  
    eps_b = 0.08 #grados
    #360/2^x = 0.08
    # 2^x = 360/0.08
    # x = log2(360/0.08)
    res = np.log2(360/eps_b)
    print("Resolucion in bits = %0.2f " %(res))


  #+END_SRC

#+RESULTS:
: Resolucion in bits = 12.14

